Tekla.Structures.Model.BaseWeld.WeldPlacementTypeEnum
Weld placement types.

Tekla.Structures.Model.BaseWeld.WeldPlacementTypeEnum.PLACEMENT_AUTO
Auto placement.

Tekla.Structures.Model.BaseWeld.WeldPlacementTypeEnum.PLACEMENT_MAIN
Main part placement.

Tekla.Structures.Model.BaseWeld.WeldPlacementTypeEnum.PLACEMENT_SECONDARY
Secondary part placement.